In [1]:
import pandas as pd

In [3]:
path=r'C:\Users\hp\Downloads\Scraping_cars\car_data.csv'
cars_df=pd.read_csv(path)

In [4]:
cars_df.head()

                Name & Date               Features    Price         Miles
0         2023 Kia Sportage             EX 4dr SUV  $27,590   5,876 miles
1        2024 Nissan Altima           2.5 SV Sedan  $20,899  18,858 miles
2     2024 Chevrolet Malibu              1LT Sedan  $19,999  22,544 miles
3  2020 Dodge Grand Caravan  SXT Passenger Minivan  $13,999  94,366 miles
4          2024 Ford Escape        ST-Line 4dr SUV  $22,990  20,417 miles

In [6]:
cars_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 210 entries, 0 to 209
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name & Date  210 non-null    object
 1   Features     210 non-null    object
 2   Price        210 non-null    object
 3   Miles        210 non-null    object
dtypes: object(4)
memory usage: 6.7+ KB

In [7]:
cars_df.drop_duplicates(inplace=True)

In [8]:
cars_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 42 entries, 0 to 41
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name & Date  42 non-null     object
 1   Features     42 non-null     object
 2   Price        42 non-null     object
 3   Miles        42 non-null     object
dtypes: object(4)
memory usage: 1.6+ KB

In [9]:
cars_df['Year'] = cars_df['Name & Date'].str.extract(r'(\d{4})')
cars_df['Name & Date'] = cars_df['Name & Date'].str.replace(r'\b\d{4}\b', '', regex=True)
cars_df['Name & Date'] = cars_df['Name & Date'].str.strip().str.replace(r'\s+,', ',', regex=True)
cars_df['Price'] = cars_df['Price'].replace('[\$,]', '', regex=True).astype(float)
cars_df['Miles'] = cars_df['Miles'].replace('[,\s]', '', regex=True).str.extract('(\d+)').astype(float)

<>:4: SyntaxWarning: invalid escape sequence '\$'
<>:5: SyntaxWarning: invalid escape sequence '\s'
<>:5: SyntaxWarning: invalid escape sequence '\d'
<>:4: SyntaxWarning: invalid escape sequence '\$'
<>:5: SyntaxWarning: invalid escape sequence '\s'
<>:5: SyntaxWarning: invalid escape sequence '\d'
C:\Users\hp\AppData\Local\Temp\ipykernel_12064\466345856.py:4: SyntaxWarning: invalid escape sequence '\$'
  cars_df['Price'] = cars_df['Price'].replace('[\$,]', '', regex=True).astype(float)
C:\Users\hp\AppData\Local\Temp\ipykernel_12064\466345856.py:5: SyntaxWarning: invalid escape sequence '\s'
  cars_df['Miles'] = cars_df['Miles'].replace('[,\s]', '', regex=True).str.extract('(\d+)').astype(float)
C:\Users\hp\AppData\Local\Temp\ipykernel_12064\466345856.py:5: SyntaxWarning: invalid escape sequence '\d'
  cars_df['Miles'] = cars_df['Miles'].replace('[,\s]', '', regex=True).str.extract('(\d+)').astype(float)

In [10]:
cars_df.head()

           Name & Date               Features    Price    Miles  Year
0         Kia Sportage             EX 4dr SUV  27590.0   5876.0  2023
1        Nissan Altima           2.5 SV Sedan  20899.0  18858.0  2024
2     Chevrolet Malibu              1LT Sedan  19999.0  22544.0  2024
3  Dodge Grand Caravan  SXT Passenger Minivan  13999.0  94366.0  2020
4          Ford Escape        ST-Line 4dr SUV  22990.0  20417.0  2024

In [ ]:
cars_df = cars_df.rename(columns={'Name & Date': 'Make & Model'})
cars_df = cars_df.rename(columns={'Features': 'Trim'})
cars_df = cars_df.rename(columns={'Miles': 'Mileage'})

In [21]:

cars_df[['Make', 'Model']] = cars_df['Make & Model'].str.split(n=1, expand=True)

In [24]:
cars_df.drop(columns=['Make & Model'], inplace=True)

In [26]:
cars_df = cars_df[['Year', 'Make', 'Model', 'Trim', 'Price', 'Mileage']]

In [28]:
cars_df.head()

   Year       Make          Model                   Trim    Price  Mileage
0  2023        Kia       Sportage             EX 4dr SUV  27590.0   5876.0
1  2024     Nissan         Altima           2.5 SV Sedan  20899.0  18858.0
2  2024  Chevrolet         Malibu              1LT Sedan  19999.0  22544.0
3  2020      Dodge  Grand Caravan  SXT Passenger Minivan  13999.0  94366.0
4  2024       Ford         Escape        ST-Line 4dr SUV  22990.0  20417.0

In [29]:
cars_df.to_csv('preprocessed_cars_data.csv', index=False)